In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'age' : [10,12,15, np.nan, 20, np.nan, 30],
    'salary' : [5000, np.nan, 20000,4000, np.nan, 6000, np.nan],
    'experience' : [2,3,5, np.nan, 6,8, np.nan]
    
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df.head()

    age   salary  experience
0  10.0   5000.0         2.0
1  12.0      NaN         3.0
2  15.0  20000.0         5.0
3   NaN   4000.0         NaN
4  20.0      NaN         6.0

In [6]:
droped_data = df.dropna()

In [7]:
df

    age   salary  experience
0  10.0   5000.0         2.0
1  12.0      NaN         3.0
2  15.0  20000.0         5.0
3   NaN   4000.0         NaN
4  20.0      NaN         6.0
5   NaN   6000.0         8.0
6  30.0      NaN         NaN

In [9]:
droped_data.head()

    age   salary  experience
0  10.0   5000.0         2.0
2  15.0  20000.0         5.0

In [10]:
droped_data.shape

(2, 3)

In [11]:
df

    age   salary  experience
0  10.0   5000.0         2.0
1  12.0      NaN         3.0
2  15.0  20000.0         5.0
3   NaN   4000.0         NaN
4  20.0      NaN         6.0
5   NaN   6000.0         8.0
6  30.0      NaN         NaN

In [33]:
from sklearn.impute import SimpleImputer, KNNImputer

In [34]:
imputer_mean = SimpleImputer(strategy= 'mean')
imputer_median = SimpleImputer(strategy= 'median')
imputer_mode = SimpleImputer(strategy= 'most_frequent')

In [35]:
df_mean = pd.DataFrame(imputer_mean.fit_transform(df), columns= df.columns)

In [36]:
df_median = pd.DataFrame(imputer_median.fit_transform(df), columns= df.columns)

In [37]:
df_mode = pd.DataFrame(imputer_mode.fit_transform(df),columns= df.columns)

In [38]:
print(df_mean)
print(df_median)
print(df_mode)

    age   salary  experience
0  10.0   5000.0         2.0
1  12.0   8750.0         3.0
2  15.0  20000.0         5.0
3  17.4   4000.0         4.8
4  20.0   8750.0         6.0
5  17.4   6000.0         8.0
6  30.0   8750.0         4.8
    age   salary  experience
0  10.0   5000.0         2.0
1  12.0   5500.0         3.0
2  15.0  20000.0         5.0
3  15.0   4000.0         5.0
4  20.0   5500.0         6.0
5  15.0   6000.0         8.0
6  30.0   5500.0         5.0
    age   salary  experience
0  10.0   5000.0         2.0
1  12.0   4000.0         3.0
2  15.0  20000.0         5.0
3  10.0   4000.0         2.0
4  20.0   4000.0         6.0
5  10.0   6000.0         8.0
6  30.0   4000.0         2.0

In [39]:
df

    age   salary  experience
0  10.0   5000.0         2.0
1  12.0      NaN         3.0
2  15.0  20000.0         5.0
3   NaN   4000.0         NaN
4  20.0      NaN         6.0
5   NaN   6000.0         8.0
6  30.0      NaN         NaN

In [41]:
knn_imputer = KNNImputer(n_neighbors= 2 )

In [42]:
knn = pd.DataFrame(knn_imputer.fit_transform(df), columns= df.columns)

In [46]:
knn

    age   salary  experience
0  10.0   5000.0         2.0
1  12.0  12500.0         3.0
2  15.0  20000.0         5.0
3  12.5   4000.0         5.0
4  20.0  13000.0         6.0
5  16.0   6000.0         8.0
6  30.0  12500.0         5.5